results/blogPost/benchclient1/quarkus-worker-pool-20000-MEASURE.wrk2.out
Running 1m test @ http://benchserver4G1:8080/hello/Grahame
  4 threads and 100 connections
  Thread calibration: mean lat.: 1.292ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.352ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.330ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.340ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.34ms  604.51us  11.26ms   66.54%
    Req/Sec     5.27k   655.61     8.78k    82.99%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.29ms
 75.000%    1.75ms
 90.000%    2.12ms
 99.000%    2.93ms
 99.900%    3.60ms
 99.990%    6.88ms
 99.999%    8.59ms
100.000%   11.27ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.134     0.000000            1         1.00
       0.584     0.100000        99765         1.11
       0.781     0.200000       199898         1.25
       0.952     0.300000       299693         1.43
       1.117     0.400000       399541         1.67
       1.287     0.500000       498805         2.00
       1.377     0.550000       548898         2.22
       1.468     0.600000       598838         2.50
       1.560     0.650000       648482         2.86
       1.655     0.700000       698307         3.33
       1.753     0.750000       748395         4.00
       1.804     0.775000       773317         4.44
       1.856     0.800000       797971         5.00
       1.912     0.825000       823128         5.71
       1.972     0.850000       847861         6.67
       2.039     0.875000       872926         8.00
       2.075     0.887500       885363         8.89
       2.115     0.900000       898103        10.00
       2.159     0.912500       910704        11.43
       2.207     0.925000       922900        13.33
       2.267     0.937500       935306        16.00
       2.301     0.943750       941387        17.78
       2.343     0.950000       947815        20.00
       2.389     0.956250       953829        22.86
       2.447     0.962500       960049        26.67
       2.515     0.968750       966432        32.00
       2.553     0.971875       969448        35.56
       2.597     0.975000       972572        40.00
       2.647     0.978125       975625        45.71
       2.709     0.981250       978803        53.33
       2.777     0.984375       981859        64.00
       2.819     0.985938       983465        71.11
       2.861     0.987500       985008        80.00
       2.905     0.989062       986527        91.43
       2.957     0.990625       988113       106.67
       3.013     0.992188       989650       128.00
       3.045     0.992969       990438       142.22
       3.081     0.993750       991224       160.00
       3.119     0.994531       991996       182.86
       3.161     0.995313       992768       213.33
       3.211     0.996094       993533       256.00
       3.241     0.996484       993939       284.44
       3.273     0.996875       994333       320.00
       3.307     0.997266       994709       365.71
       3.347     0.997656       995104       426.67
       3.397     0.998047       995481       512.00
       3.425     0.998242       995674       568.89
       3.459     0.998437       995870       640.00
       3.493     0.998633       996063       731.43
       3.537     0.998828       996257       853.33
       3.605     0.999023       996450      1024.00
       3.647     0.999121       996552      1137.78
       3.711     0.999219       996645      1280.00
       3.785     0.999316       996744      1462.86
       3.915     0.999414       996840      1706.67
       4.143     0.999512       996937      2048.00
       4.259     0.999561       996986      2275.56
       4.387     0.999609       997035      2560.00
       4.563     0.999658       997086      2925.71
       4.883     0.999707       997132      3413.33
       5.499     0.999756       997181      4096.00
       5.755     0.999780       997205      4551.11
       5.979     0.999805       997230      5120.00
       6.163     0.999829       997254      5851.43
       6.463     0.999854       997278      6826.67
       6.719     0.999878       997303      8192.00
       6.807     0.999890       997315      9102.22
       6.943     0.999902       997327     10240.00
       7.035     0.999915       997339     11702.86
       7.127     0.999927       997351     13653.33
       7.295     0.999939       997364     16384.00
       7.419     0.999945       997371     18204.44
       7.471     0.999951       997376     20480.00
       7.615     0.999957       997383     23405.71
       7.687     0.999963       997388     27306.67
       7.771     0.999969       997394     32768.00
       7.871     0.999973       997398     36408.89
       8.063     0.999976       997400     40960.00
       8.199     0.999979       997403     46811.43
       8.295     0.999982       997406     54613.33
       8.423     0.999985       997409     65536.00
       8.447     0.999986       997413     72817.78
       8.447     0.999988       997413     81920.00
       8.591     0.999989       997414     93622.86
       8.727     0.999991       997415    109226.67
       8.871     0.999992       997417    131072.00
       8.879     0.999993       997418    145635.56
       8.879     0.999994       997418    163840.00
       8.999     0.999995       997419    187245.71
       9.007     0.999995       997420    218453.33
       9.055     0.999996       997421    262144.00
       9.055     0.999997       997421    291271.11
       9.055     0.999997       997421    327680.00
       9.255     0.999997       997422    374491.43
       9.255     0.999998       997422    436906.67
       9.263     0.999998       997423    524288.00
       9.263     0.999998       997423    582542.22
       9.263     0.999998       997423    655360.00
       9.263     0.999999       997423    748982.86
       9.263     0.999999       997423    873813.33
      11.271     0.999999       997424   1048576.00
      11.271     1.000000       997424          inf
#[Mean    =        1.336, StdDeviation   =        0.605]
#[Max     =       11.264, Total count    =       997424]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1198748 requests in 1.00m, 105.18MB read
Requests/sec:  19978.88
Transfer/sec:      1.75MB