results/blogPost/benchclient1/quarkus-worker-pool-30000-MEASURE.wrk2.out
Running 1m test @ http://benchserver4G1:8080/hello/Grahame
  4 threads and 100 connections
  Thread calibration: mean lat.: 1.233ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.230ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.214ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.219ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.24ms  560.96us   8.35ms   65.75%
    Req/Sec     7.92k   511.05    11.60k    73.10%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.19ms
 75.000%    1.64ms
 90.000%    1.98ms
 99.000%    2.71ms
 99.900%    3.44ms
 99.990%    5.00ms
 99.999%    6.63ms
100.000%    8.36ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.127     0.000000            1         1.00
       0.554     0.100000       150205         1.11
       0.723     0.200000       300144         1.25
       0.874     0.300000       448969         1.43
       1.029     0.400000       598828         1.67
       1.190     0.500000       748899         2.00
       1.275     0.550000       823187         2.22
       1.364     0.600000       898031         2.50
       1.454     0.650000       973212         2.86
       1.546     0.700000      1047894         3.33
       1.640     0.750000      1122356         4.00
       1.689     0.775000      1159894         4.44
       1.739     0.800000      1197238         5.00
       1.791     0.825000      1234440         5.71
       1.848     0.850000      1271910         6.67
       1.911     0.875000      1309261         8.00
       1.946     0.887500      1327968         8.89
       1.984     0.900000      1346819        10.00
       2.025     0.912500      1365316        11.43
       2.073     0.925000      1384619        13.33
       2.125     0.937500      1402754        16.00
       2.157     0.943750      1412526        17.78
       2.191     0.950000      1421558        20.00
       2.231     0.956250      1431080        22.86
       2.277     0.962500      1440422        26.67
       2.331     0.968750      1449565        32.00
       2.363     0.971875      1454248        35.56
       2.399     0.975000      1458946        40.00
       2.439     0.978125      1463500        45.71
       2.489     0.981250      1468301        53.33
       2.549     0.984375      1472927        64.00
       2.585     0.985938      1475244        71.11
       2.627     0.987500      1477592        80.00
       2.675     0.989062      1479919        91.43
       2.731     0.990625      1482250       106.67
       2.797     0.992188      1484551       128.00
       2.833     0.992969      1485717       142.22
       2.873     0.993750      1486863       160.00
       2.919     0.994531      1488056       182.86
       2.969     0.995313      1489210       213.33
       3.029     0.996094      1490367       256.00
       3.067     0.996484      1490960       284.44
       3.107     0.996875      1491548       320.00
       3.149     0.997266      1492136       365.71
       3.195     0.997656      1492708       426.67
       3.247     0.998047      1493302       512.00
       3.275     0.998242      1493588       568.89
       3.309     0.998437      1493881       640.00
       3.349     0.998633      1494171       731.43
       3.397     0.998828      1494474       853.33
       3.445     0.999023      1494755      1024.00
       3.475     0.999121      1494897      1137.78
       3.511     0.999219      1495042      1280.00
       3.555     0.999316      1495191      1462.86
       3.609     0.999414      1495334      1706.67
       3.685     0.999512      1495484      2048.00
       3.729     0.999561      1495554      2275.56
       3.779     0.999609      1495626      2560.00
       3.847     0.999658      1495698      2925.71
       3.949     0.999707      1495772      3413.33
       4.079     0.999756      1495843      4096.00
       4.171     0.999780      1495880      4551.11
       4.287     0.999805      1495916      5120.00
       4.439     0.999829      1495953      5851.43
       4.587     0.999854      1495991      6826.67
       4.763     0.999878      1496026      8192.00
       4.879     0.999890      1496044      9102.22
       5.015     0.999902      1496062     10240.00
       5.167     0.999915      1496081     11702.86
       5.307     0.999927      1496099     13653.33
       5.455     0.999939      1496118     16384.00
       5.583     0.999945      1496126     18204.44
       5.671     0.999951      1496135     20480.00
       5.803     0.999957      1496145     23405.71
       5.883     0.999963      1496154     27306.67
       5.971     0.999969      1496163     32768.00
       6.091     0.999973      1496168     36408.89
       6.215     0.999976      1496172     40960.00
       6.323     0.999979      1496178     46811.43
       6.363     0.999982      1496181     54613.33
       6.459     0.999985      1496186     65536.00
       6.507     0.999986      1496188     72817.78
       6.535     0.999988      1496190     81920.00
       6.631     0.999989      1496193     93622.86
       6.671     0.999991      1496195    109226.67
       6.707     0.999992      1496197    131072.00
       6.711     0.999993      1496198    145635.56
       6.723     0.999994      1496199    163840.00
       6.799     0.999995      1496201    187245.71
       6.911     0.999995      1496202    218453.33
       6.915     0.999996      1496203    262144.00
       6.915     0.999997      1496203    291271.11
       6.947     0.999997      1496204    327680.00
       6.995     0.999997      1496205    374491.43
       6.995     0.999998      1496205    436906.67
       7.143     0.999998      1496206    524288.00
       7.143     0.999998      1496206    582542.22
       7.143     0.999998      1496206    655360.00
       7.291     0.999999      1496207    748982.86
       7.291     0.999999      1496207    873813.33
       7.291     0.999999      1496207   1048576.00
       7.291     0.999999      1496207   1165084.44
       7.291     0.999999      1496207   1310720.00
       8.359     0.999999      1496208   1497965.71
       8.359     1.000000      1496208          inf
#[Mean    =        1.245, StdDeviation   =        0.561]
#[Max     =        8.352, Total count    =      1496208]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1798180 requests in 1.00m, 157.77MB read
Requests/sec:  29969.98
Transfer/sec:      2.63MB