results/blogPost/benchclient1/quarkus-worker-pool-30000-WARM-UP.wrk2.out
Running 1m test @ http://benchserver4G1:8080/hello/Grahame
  4 threads and 100 connections
  Thread calibration: mean lat.: 1.222ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.238ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.230ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.233ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.46ms    3.10ms  86.02ms   99.25%
    Req/Sec     7.92k     1.00k   26.22k    93.46%
  1798175 requests in 1.00m, 157.77MB read
Requests/sec:  29969.31
Transfer/sec:      2.63MB